"UI_OK"                    = "OK";
"UI_CANCEL"                = "Cancel";
"UI_YES"                   = "Yes";
"UI_NO"                    = "No";
"UI_CONNECT"               = "Connect";

"TSC_IDS_SECAUTH_AUTH_DISABLED_TITLE"					   = "Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.";

"TSC_IDS_SECAUTH_AUTH_DISABLED_AT_SERVER_PROMPT_CONTINUE"  = "This problem can occur if:\n\n • The remote computer is running a version of Windows that is earlier than Windows Vista.\n • The remote computer is configured to support only the RDP security layer.\n\nContact your administrator, or the owner of the remote computer for assistance.\n\nDo you want to connect anyway?";
"TSC_IDS_SECAUTH_AUTH_DISABLED_AT_SERVER_NO_CONTINUE"      = "This problem can occur if:\n\n • The remote computer is running a version of Windows that is earlier than Windows Vista.\n • The remote computer is configured to support only the RDP security layer.\n\nContact your administrator, or the owner of the remote computer for assistance.";

"TSC_IDS_SECAUTH_AUTH_ERROR"                               = "Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.";

"TSC_IDS_SECAUTH_AUTH_ERROR_INFOR"						   = "Try reconnecting to the Windows-based computer, or contact our administrator.";

"TSC_IDS_SECAUTH_CERT_EXPIRED"                             = "The certificate has expired or is not yet valid.";
"TSC_IDS_SECAUTH_NAME_MISMATCH"                            = "The server name on the certificate is incorrect.";
"TSC_IDS_SECAUTH_FAIL_TO_CHAIN_TO_TRUSTED_ROOT"            = "The certificate is not from a trusted certification authority (CA).";
"TSC_IDS_SECAUTH_CERT_REVOKED"                             = "The certificate has been revoked and is not safe to use.";
"TSC_IDS_SECAUTH_UNABLE_TO_PERFORM_REVOCATION_CHECK"       = "A revocation check could not be performed for the certificate.";
"TSC_IDS_SECAUTH_CERT_OR_CHAIN_INVALID"                    = "The certificate or associated chain is not valid.";

"TSC_IDS_SECAUTH_ALLOW_CONNECT_ANYWAY"                     = "Do you want to connect to this computer anyway?";
"TSC_IDS_SECAUTH_CANNOT_PROCEED_REQUIRED"                  = "You cannot continue because your current preferences require authentication to connect to the Windows-based computer.";


"TSC_IDS_ENTER_TS_CREDS_ACTION"                            = "Enter your credentials";
"TSC_IDS_ENTER_TS_CREDS_DETAILS"                           = "These credentials will be used to connect to %s.";
"TSC_IDS_PREAUTH_LOGON_FAILURE_ACTION"                     = "Try again";
"TSC_IDS_PREAUTH_LOGON_FAILURE_DETAILS"                    = "The credentials that were used to connect to %s are incorrect. Please enter your credentials again.";


